ig.translit = translit = {"А": "A", "Б": "B", "В": "V", "Г": "H", "Ґ": "G", "Д": "D", "Е": "E", "Є": "Y", "З": "Z", "И": "Y", "І": "I", "Ї": "Y", "Й": "Y", "К": "K", "Л": "L", "М": "M", "Н": "N", "О": "O", "П": "P", "Р": "R", "С": "S", "Т": "T", "У": "U", "Ф": "F", "Ю": "Y", "Я": "Y", "a": "а", "б": "b", "в": "v", "г": "h", "ґ": "g", "д": "d", "е": "e", "є": "e", "з": "z", "и": "y", "і": "i", "ї": "i", "к": "k", "л": "l", "м": "m", "н": "n", "о": "o", "п": "p", "р": "r", "с": "s", "т": "t", "у": "u", "ф": "f", "ю": "u", "я": "a", "Ж": "Zh", "Х": "Kh", "Ц": "Ts", "Ч": "Ch", "Ш": "Sh", "Щ": "Shch", "ж": "zh", "х": "kh", "ц": "ts", "ч": "ch", "ш": "sh", "щ": "shch", "ь": "ʹ"}

ig.transliterate = (str) ->
	out = for i in [0 til str.length]
		if translit[str[i]] then that else str[i]
	out.join ''
